cmsis-svd/cmsis-svd/data/Spansion/MB9AF14xM.svd
        <!-- REGISTER "EPFR06" -->
        <register>
          <name>EPFR06</name>
          <description>Extended pin function setting register 06</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF003FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT15S" -->
            <field>
              <name>EINT15S</name>
              <description>External interrupt 15 input select bit</description>
              <lsb>30</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT14S" -->
            <field>
              <name>EINT14S</name>
              <description>External interrupt 14 input select bit</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT08S" -->
            <field>
              <name>EINT08S</name>
              <description>External interrupt 8 input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT07S" -->
            <field>
              <name>EINT07S</name>
              <description>External interrupt 7 input select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT06S" -->
            <field>
              <name>EINT06S</name>
              <description>External interrupt 6 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT05S" -->
            <field>
              <name>EINT05S</name>
              <description>External interrupt 5 input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT04S" -->
            <field>
              <name>EINT04S</name>
              <description>External interrupt 4 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT03S" -->
            <field>
              <name>EINT03S</name>
              <description>External interrupt 3 input select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT02S" -->
            <field>
              <name>EINT02S</name>
              <description>External interrupt 2 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT01S" -->
            <field>
              <name>EINT01S</name>
              <description>External interrupt 1 input select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT00S" -->
            <field>
              <name>EINT00S</name>
              <description>External interrupt 0 input select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR07" -->
        <register>
          <name>EPFR07</name>
          <description>Extended pin function setting register 07</description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SCK3B" -->
            <field>
              <name>SCK3B</name>
              <description>SCK3 input/output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT3B" -->
            <field>
              <name>SOT3B</name>
              <description>SOT3B input/output select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN3S" -->
            <field>
              <name>SIN3S</name>
              <description>SIN3S input select bit</description>
              <lsb>22</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK2B" -->
            <field>
              <name>SCK2B</name>
              <description>SCK2 input/output select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT2B" -->
            <field>
              <name>SOT2B</name>
              <description>SOT2B input/output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN2S" -->
            <field>
              <name>SIN2S</name>
              <description>SIN2S input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK1B" -->
            <field>
              <name>SCK1B</name>
              <description>SCK1 input/output select bit</description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT1B" -->
            <field>
              <name>SOT1B</name>
              <description>SCK1B input/output select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN1S" -->
            <field>
              <name>SIN1S</name>
              <description>SIN1S input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCK0B" -->
            <field>
              <name>SCK0B</name>
              <description>SCK0 input/output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOT0B" -->
            <field>
              <name>SOT0B</name>
              <description>SOT0B input/output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SIN0S" -->
            <field>
              <name>SIN0S</name>
              <description>SIN0S input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
